from enum import Enum


class Templates(Enum):
    NO_MARKUPS = 'У путешествия нет заметок. Пора добавить!'
    NO_VISIBLE_MARKUPS = 'У путешествия нет доступных вам заметок. Можно добавить свои!'
    SELECT_TYPE = 'Выберите тип заметки:'
    SELECT_ACT = 'Выберете, что хотите сделать с заметкой:'
    SELECT_MARKUP = 'Список доступных вам заметок:'
    SENDED = 'Заметка отправлена!'
    SEND_FILE = 'Отправьте файл (не больше 20 МБ) или фотографию (можно несколько).'
    FILE_SENDED = 'Заметка сохранена!'
    DELETED = 'Заметка удалена!'
